harmony.common.security/target/classes/data/InvalidIsAvailable.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">http://localhost:8080/harmony-adapter-dummy/services/Reservation</wsa:To>
        <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">http://ist_phosphorus.eu/nsp/webservice/reservation/isAvailable</wsa:Action>
        <wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">uuid:c0510a26-d7c2-a321-9a6b-4e1cd7748f4e</wsa:MessageID>
        <wsa:From xmlns:wsa="http://www.w3.org/2005/08/addressing">
            <wsa:Address>http://www.w3.org/2005/08/addressing/role/anonymous</wsa:Address>
        </wsa:From>
    </soap:Header>
    <soap:Body>
        <pfx0:isAvailable xmlns:pfx0="http://ist_phosphorus.eu/nsp/webservice/reservation">
            <pfx0:isAvailable xmlns="http://ist_phosphorus.eu/nsp"
                xmlns:ns2="http://ist_phosphorus.eu/nsp/webservice/notification"
                xmlns:ns3="http://ist_phosphorus.eu/nsp/webservice/topology"
                xmlns:ns4="http://ist_phosphorus.eu/nsp/webservice/reservation"
                xmlns:ns5="http://docs.oasis-open.org/wsrf/bf-2" xmlns:ns6="http://www.w3.org/2005/08/addressing">
                <ns4:isAvailable xmlns:ns4="http://ist_phosphorus.eu/nsp/webservice/reservation">
                    <ns4:Service>
                        <ns4:ServiceID>42</ns4:ServiceID>
                        <ns4:TypeOfReservation>fixed</ns4:TypeOfReservation>
                        <ns4:FixedReservationConstraints>
                            <ns4:StartTime>2008-07-22T15:24:04.099+02:00</ns4:StartTime>
                            <ns4:Duration>100</ns4:Duration>
                        </ns4:FixedReservationConstraints>
                        <ns4:AutomaticActivation>true</ns4:AutomaticActivation>
                        <ns4:Connections>
                            <ns4:ConnectionID>0</ns4:ConnectionID>
                            <ns4:Source>
                                <EndpointId xmlns="http://ist_phosphorus.eu/nsp">192.0.0.2</EndpointId>
                            </ns4:Source>
                            <ns4:Target>
                                <EndpointId xmlns="http://ist_phosphorus.eu/nsp">192.0.0.1</EndpointId>
                            </ns4:Target>
                            <ns4:Directionality>0</ns4:Directionality>
                            <ns4:MinBW>100</ns4:MinBW>
                            <ns4:MaxDelay>800</ns4:MaxDelay>
                        </ns4:Connections>
                    </ns4:Service>
                </ns4:isAvailable>
            </pfx0:isAvailable>
        </pfx0:isAvailable>
    </soap:Body>
</soap:Envelope>